## Most Frequent Used Methods in EDA

#### 1. Load Data

df= pd.read_csv('file.csv')

#### 2. Top 5 and Bottom 5 Records
df.head()

df.tail()

#### 3. Renaming the column names

df.rename(columns={'OldName': 'NewName'}, inplace=True)

In [2]:
import pandas as pd

data= {"Name": ["sindhu", "Sana"],
       "Marks": [80, 85]}
df= pd.DataFrame(data)
df.rename(columns = {"Marks":"Score"}, inplace = True)
df

     Name  Score
0  sindhu     80
1    Sana     85

#### 4. Staistical description
df.describe

#### 5. Adding new column

In [ ]:
data = {
    'Math': [85, 90, 78, 92, 88],
    'Science': [80, 95, 70, 89, 94]
}

df = pd.DataFrame(data)
df['Total'] = df['Math']+df['Science']
df['Average'] = df['Total']/2
df

#### 6. Dropping column

df.drop('ColumnName', axis=1, inplace=True)

In [5]:
df.drop('Average', axis = 1, inplace=True)
df

   Math  Science  Total
0    85       80    165
1    90       95    185
2    78       70    148
3    92       89    181
4    88       94    182

#### 7. Setting any column in index

In [7]:
data = {
    'ID': [101, 102, 103],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Score': [85, 90, 95]
}
df= pd.DataFrame(data)
df

    ID     Name  Score
0  101    Alice     85
1  102      Bob     90
2  103  Charlie     95

In [8]:
df_indexed = df.set_index('ID')
df_indexed

        Name  Score
ID
101    Alice     85
102      Bob     90
103  Charlie     95

#### 8. Resetting index

In [9]:
df.reset_index(inplace=True)

In [10]:
df

   index   ID     Name  Score
0      0  101    Alice     85
1      1  102      Bob     90
2      2  103  Charlie     95

#### 9. Selecting row with index position

df.iloc[0] → first row
df.iloc[-1] → last row
df.iloc[1:3]  # rows at position 1 and 2

In [14]:
row = df.iloc[1]
row

index      1
ID       102
Name     Bob
Score     90
Name: 1, dtype: object

#### 10. Selecting subsection of the dataset with LOC and iloc

df.iloc[row_start:row_end, col_start:col_end]

In [16]:
subset = df.iloc[1:3, 0:2]
subset

   index   ID
1      1  102
2      2  103

#### 11. Drop row

df.drop('a', axis=0, inplace=True)
df = df.drop(df.index[1])  # drops the second row

In [1]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}, index=['a', 'b', 'c'])

df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [2]:
df.drop('b', axis=0, inplace=True)

In [3]:
df

      Name  Age
a    Alice   25
c  Charlie   35

df = df.drop(df.index[1])  # drops the second row

#### 12. Filtering rows with conditional

In [ ]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40]
})
df

In [10]:
df= df[df['Age']<35]
df

    Name  Age
0  Alice   25
1    Bob   30

#### 13. Apply function on single column

In [11]:
df = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie'],
    'Salary': [50000, 60000, 70000]
})
df

  Employee  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000

In [13]:
df['Salary Increment'] = df['Salary'].apply([lambda x: x*1.10])
df

  Employee  Salary  Salary Increment
0    Alice   50000           55000.0
1      Bob   60000           66000.0
2  Charlie   70000           77000.0

#### 14. Apply func on multiple column using Lambda function

To apply a function to multiple columns using a lambda function, you use .apply() with 
axis=1 — this tells pandas to apply the function row-wise.

df.apply(lambda row: your_logic(row['col1'], row['col2']), axis=1)

In [6]:
df = pd.DataFrame({
    'Product': ['Laptop', 'Phone', 'Tablet'],
    'Price': [1000, 500, 300],
    'Quantity': [2, 5, 3]
})

df

  Product  Price  Quantity
0  Laptop   1000         2
1   Phone    500         5
2  Tablet    300         3

In [7]:
df['Total']= df.apply([lambda x: x['Price']*x['Quantity']], axis = 1) # axis=1 creates a new column 'Total'
df

  Product  Price  Quantity  Total
0  Laptop   1000         2   2000
1   Phone    500         5   2500
2  Tablet    300         3    900

In [21]:
df['Discount'] = df.apply(lambda x: x['Total'] * 0.9 if x['Quantity'] > 3 else x['Total'], axis=1)
df

  Product  Price  Quantity  Total  Discount
0  Laptop   1000         2   2000    2000.0
1   Phone    500         5   2500    2250.0
2  Tablet    300         3    900     900.0

#### 15. Sorting method

df.sort_values(by='ColumnName', ascending=True, inplace=False)
df.sort_index(ascending=True, inplace=True)

In [9]:
import pandas as pd
data = {
    'Name': ['Sindhu', 'Hema', 'Prakash', 'Shanthi'],
    'Age': [28, 22, 32, 25],
    'Score': [85, 95, 70, 88]
}
df = pd.DataFrame(data)
df

      Name  Age  Score
0   Sindhu   28     85
1     Hema   22     95
2  Prakash   32     70
3  Shanthi   25     88

In [13]:
df_sorted = df.sort_values(by='Age',ascending = True)
df_sorted

      Name  Age  Score
1     Hema   22     95
3  Shanthi   25     88
0   Sindhu   28     85
2  Prakash   32     70

In [16]:
df_sorted1 = df.sort_values(by = 'Score', ascending = False)
df_sorted1

      Name  Age  Score
1     Hema   22     95
3  Shanthi   25     88
0   Sindhu   28     85
2  Prakash   32     70

#### 16. Min,max and their index position

In [22]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 22, 40]
})

min_age = df['Age'].min()         # 22
max_age = df['Age'].max()         # 40

min_age_index = df['Age'].idxmin()  # 2 (index of 'Charlie')
max_age_index = df['Age'].idxmax()  # 3 (index of 'David')

print(f"Min Age: {min_age} at index {min_age_index}")
print(f"Max Age: {max_age} at index {max_age_index}")

Min Age: 22 at index 2
Max Age: 40 at index 3

#### 17. Value_counts

df['ColumnName'].value_counts()

In [6]:
data = {'city':['london', 'paris', 'USA', 'london','paris', 'london']}
df= pd.DataFrame(data)
df.value_counts()

city
london    3
paris     2
USA       1
Name: count, dtype: int64

#### 18. Unique/nunique

In [17]:
df = pd.DataFrame({
    'A': [1, 2, 2, 3],
    'B': [4, 4, 5, 5]
})
df.nunique()

A    3
B    2
dtype: int64

#### 19. Replace/mapfunction

-- Replace() in Pandas
Used to substitute values in a DataFrame or Series.

In [5]:
import pandas as pd

df = pd.DataFrame({
    'gender': ['M', 'F', 'M', 'F', 'M']
})
df['gender'] = df['gender'].replace({'M': 'Male', 'F': 'Female'})
print(df)

   gender
0    Male
1  Female
2    Male
3  Female
4    Male

-- map() in Pandas
Used to map values using a function or dictionary — works only on Series, not entire DataFrames.

In [8]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40]
})
df['Name'] = df['Name'].map(lambda x: x.upper())
df

      Name  Age
0    ALICE   25
1      BOB   30
2  CHARLIE   35
3    DAVID   40

#### 20. Duplicates

In [13]:
df= pd.DataFrame([1,2,2,3,3,4,5,6,6,7,8,8,10])
df.duplicated().sum()

4

In [14]:
df.drop_duplicates()

     0
0    1
1    2
3    3
5    4
6    5
7    6
9    7
10   8
12  10

#### 21. nlargest/nsmallest to get highest/lowest records

df.nlargest(n, columns)

-- Works only on numeric columns.

nlargest() and nsmallest() can be chained with groupby() for more advanced usage.

In [8]:
data = {
    'Math': [85, 90, 78, 92, 88]
}
df = pd.DataFrame(data)
high = df.nlargest(3, 'Math')       #top 3 highest marks
high

   Math
3    92
1    90
4    88

In [9]:
low= df.nsmallest(2, 'Math')    # lowest 2 marks
low

   Math
2    78
0    85

#### 22. Handling Missing Values

In [ ]:
df.isnull()                # Returns a DataFrame of True/False
df.isnull().sum()          # Total missing values per column
df.info()                  # Shows count of non-null entries
df.dropna(inplace=True)
df.dropna(axis=1, inplace=True)
df['column'].fillna(df['column'].mean(), inplace=True)     # Fills missing values with the mean (average) of the column.
df['column'].fillna(df['column'].median(), inplace=True)   # Fills missing values with the median (middle value) of the column
df['column'].fillna(df['column'].mode()[0], inplace=True)  # Fills missing values with the mode (most frequent value) of the column

#### 23. Group by operation on pandas

df.groupby('column_name')
df.groupby(('col1')['col2'])  # for multiple columns

In [2]:
import pandas as pd

# Sample data
data = {
    'Department': ['Sales', 'Sales', 'HR', 'HR', 'IT'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Salary': [50000, 55000, 60000, 62000, 70000]
}
df = pd.DataFrame(data)

# Group by Department and calculate average salary

grouped = df.groupby('Department')['Salary'].mean()
print(grouped)

Department
HR       61000.0
IT       70000.0
Sales    52500.0
Name: Salary, dtype: float64

#### 24. Combine DataFrame --- CONCATENATION

In [5]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'ID': [4, 5],
    'Name': ['David', 'Eva']
})
df_combined = pd.concat([df1, df2])
df_combined

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
0   4    David
1   5      Eva

If you want to concatenate horizontally (side by side):

df_combined = pd.concat([df1, df2], axis=1)

In [8]:
df_combined1 = pd.concat([df1, df2], axis=1)
df_combined1

   ID     Name   ID   Name
0   1    Alice  4.0  David
1   2      Bob  5.0    Eva
2   3  Charlie  NaN    NaN

In [ ]:
ignore_index=True: resets the index in the result

In [11]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'ID': [4, 5],
    'Name': ['David', 'Eva']
})
df_combined = pd.concat([df1, df2], ignore_index = True)
df_combined

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David
4   5      Eva

#### 25. Combining DataFrame -- MERGING -- JOIN(LEFT/RIGHT/INNER/OUTER)

-- pd.merge(df1, df2, on='ID', how='inner')

-- left_on=, right_on=: use when column names differ

In [15]:
import pandas as pd

# Left DataFrame
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
})

# Right DataFrame
df2 = pd.DataFrame({
    'ID': [3, 4, 5, 6],
    'Score': [85, 90, 75, 60]
})
pd.merge(df1, df2, on = 'ID', how= 'inner')

   ID     Name  Score
0   3  Charlie     85
1   4    David     90

In [16]:
pd.merge(df1, df2, on = 'ID', how = 'left')

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob    NaN
2   3  Charlie   85.0
3   4    David   90.0

In [17]:
pd.merge(df1, df2, on = 'ID', how = 'right')

   ID     Name  Score
0   3  Charlie     85
1   4    David     90
2   5      NaN     75
3   6      NaN     60

In [18]:
pd.merge(df1, df2, on = 'ID', how = 'outer')

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob    NaN
2   3  Charlie   85.0
3   4    David   90.0
4   5      NaN   75.0
5   6      NaN   60.0

#### 26. Text method on string data

| **Method**            | **Description**                    | **Example**                         |
| --------------------- | ---------------------------------- | ----------------------------------- |
| `str.lower()`         | Convert to lowercase               | `df['Name'].str.lower()`            |
| `str.upper()`         | Convert to uppercase               | `df['Name'].str.upper()`            |
| `str.title()`         | Title case (capitalize each word)  | `df['Name'].str.title()`            |
| `str.strip()`         | Remove leading/trailing whitespace | `df['Name'].str.strip()`            |
| `str.replace(a, b)`   | Replace substring `a` with `b`     | `df['Name'].str.replace('a', '@')`  |
| `str.contains('x')`   | Boolean: contains substring `'x'`  | `df['Name'].str.contains('a')`      |
| `str.startswith('A')` | Check if starts with `'A'`         | `df['Name'].str.startswith('A')`    |
| `str.endswith('d')`   | Check if ends with `'d'`           | `df['Name'].str.endswith('d')`      |
| `str.len()`           | String length                      | `df['Name'].str.len()`              |
| `str.extract()`       | Extract using regex pattern        | `df['Name'].str.extract('([A-Z])')` |
| `str.split()`         | Split strings                      | `df['Name'].str.split(' ')`         |
| `str.cat()`           | Concatenate strings                | `df['Name'].str.cat(sep=' - ')`     |

In [18]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Vihaan', 'Angel', 'Nila', 'Banu', 'Kathir']
})
# Make all names uppercase
df['Name_Upper'] = df['Name'].str.upper()
df['Name_Upper']

0    VIHAAN
1     ANGEL
2      NILA
3      BANU
4    KATHIR
Name: Name_Upper, dtype: object

In [21]:
# Filter rows where the name contains the letter 'h' (case insensitive)
# Case insensitive means ignoring whether letters are uppercase or lowercase when doing a comparison or search.
filtered = df[df['Name'].str.contains('h', case=False)]
filtered

     Name Name_Upper
0  Vihaan     VIHAAN
4  Kathir     KATHIR

#### 27. Cleaning of Data

##### Remove Unwanted Characters (Regex Cleaning)
df['Phone'] = df['Phone'].str.replace(r'[^0-9]', '', regex=True)  # Keep digits only

##### Convert Data Types
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')  # Convert to numbers

df['JoinDate'] = pd.to_datetime(df['JoinDate'], errors='coerce')

##### Rename Columns for Clarity

df.rename(columns={'Name ': 'Name', 'E-mail': 'Email'}, inplace=True)

In [30]:
import pandas as pd
df = pd.DataFrame({
    'Name ': [' Alice ', 'BOB', 'Charlie  ', None],
    'E-mail': ['ALICE@EXAMPLE.COM', 'bob@example.com', None, 'david@sample.com'],
    'Phone': ['+1 (123) 456-7890', '123.456.7890', '1234567890', 'N/A'],
    'Age': ['25', 'thirty', '40', None]
})
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')  # Clean column names
df['name'] = df['name'].str.strip().str.title()
df['email'] = df['e-mail'].str.lower()
df['phone'] = df['phone'].str.replace(r'\D', '', regex=True)
df['age'] = pd.to_numeric(df['age'], errors='coerce')

df.drop('e-mail', axis=1, inplace=True)
df

      name        phone   age              email
0    Alice  11234567890  25.0  alice@example.com
1      Bob   1234567890   NaN    bob@example.com
2  Charlie   1234567890  40.0               None
3     None                NaN   david@sample.com